Revit 2027 API
Connector.AllowsSlopeAdjustments Property
 Indicates if the connector allows the slope adjustment.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AllowsSlopeAdjustments { get; }
Public ReadOnly Property AllowsSlopeAdjustments As Boolean
	Get
public:
property bool AllowsSlopeAdjustments {
	bool get ();
}
member AllowsSlopeAdjustments : bool with get
Property Value
Boolean
See Also
Reference
Connector Class
Autodesk.Revit.DB Namespace